tutorials/combustion/XiFoam/ras/moriyoshiHomogeneous/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (0 0 0)
    (0 35 0)
    (70 0 0)
    (70 35 0)
    (0 0 1)
    (0 35 1)
    (70 0 1)
    (70 35 1)
);

blocks
(
    hex (0 2 3 1 4 6 7 5) (70 35 1) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    symmetryPlane left
    (
        (0 4 5 1)
    )
    symmetryPlane right
    (
        (2 3 7 6)
    )
    symmetryPlane top
    (
        (1 5 7 3)
    )
    symmetryPlane bottom
    (
        (0 2 6 4)
    )
    empty frontAndBack
    (
        (4 5 7 6)
        (0 1 3 2)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
